In [25]:
import pandas as pd
import numpy as np

employees = pd.DataFrame({
    'id': list(range(1, 41)),
    'first_name': ['Ana', 'Bob', 'Cara', 'Dave', 'Eve', 'Frank', 'Grace', 'Hank', 'Iris', 'Jack',
                   'Kevin', 'Lisa', 'Mike', 'Nina', 'Omar', 'Paula', 'Quinn', 'Rosa', 'Sam', 'Tina',
                   'Uma', 'Victor', 'Wendy', 'Xavier', 'Yara', 'Zack', 'Amy', 'Brian', 'Chloe', 'Dan',
                   'Ella', 'Fred', 'Gina', 'Hugo', 'Ivy', 'Jake', 'Kim', 'Leo', 'Mia', 'Noah'],
    'last_name': ['Smith', 'Jones', 'Brown', 'Wilson', 'Davis', 'Miller', 'Moore', 'Taylor', 'Anderson', 'Thomas',
                  'Martin', 'Garcia', 'Rodriguez', 'Lee', 'White', 'Harris', 'Clark', 'Lewis', 'Robinson', 'Walker',
                  'Hall', 'Allen', 'Young', 'King', 'Wright', 'Lopez', 'Hill', 'Scott', 'Green', 'Adams',
                  'Baker', 'Nelson', 'Carter', 'Mitchell', 'Perez', 'Roberts', 'Turner', 'Phillips', 'Campbell', 'Parker'],
    'dept': ['Tech', 'Sales', 'Tech', 'Marketing', 'Tech', 'Sales', 'Marketing', 'Tech', 'Sales', None,
             'Tech', 'Sales', 'Marketing', 'Tech', 'HR', 'Sales', 'Tech', 'Marketing', 'Sales', 'Tech',
             'Marketing', 'Tech', 'Sales', 'HR', 'Tech', 'Sales', 'Marketing', 'Tech', 'Sales', 'Marketing',
             'Tech', 'HR', 'Sales', 'Tech', 'Marketing', 'Sales', 'Tech', 'Marketing', 'HR', 'Tech'],
    'salary': [95000, 80000, 92000, 75000, 98000, 82000, 77000, 91000, 79000, None,
               88000, 76000, 73000, 105000, 65000, 84000, 96000, 78000, 81000, 93000,
               74000, 102000, 77000, 68000, 89000, 85000, 71000, 94000, 83000, 72000,
               99000, 67000, 86000, 107000, 76000, 78000, 90000, 79000, 70000, 87000],
    'manager_id': [None, 1, 1, 2, 1, 2, 4, 3, 6, 7,
                   3, 6, 4, 1, None, 2, 3, 4, 6, 1,
                   4, 3, 2, 15, 14, 6, 13, 14, 6, 13,
                   14, 15, 2, 14, 13, 6, 14, 13, 15, 14],
    'hire_date': ['2018-01-15', '2019-03-22', '2018-06-30', '2020-01-10', '2017-09-01', 
                  '2019-11-15', '2020-08-20', '2018-04-12', '2021-02-28', '2022-05-16',
                  '2019-04-01', '2020-11-30', '2021-06-15', '2017-11-20', '2019-07-08',
                  '2020-03-25', '2018-09-10', '2021-01-18', '2019-12-05', '2018-02-28',
                  '2020-09-14', '2017-12-01', '2020-06-22', '2019-08-30', '2018-07-25',
                  '2021-03-10', '2020-12-07', '2018-05-20', '2021-04-12', '2020-10-05',
                  '2017-10-15', '2019-09-18', '2021-05-25', '2018-03-08', '2020-07-13',
                  '2021-08-02', '2018-08-17', '2020-04-27', '2019-10-22', '2018-11-30']
})

departments = pd.DataFrame({
    'dname': ['Tech', 'Sales', 'Marketing', 'HR'],
    'budget': [1400000, 950000, 750000, 280000]
})

In [27]:
employees.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          40 non-null     int64
 1   first_name  40 non-null     object
 2   last_name   40 non-null     object
 3   dept        39 non-null     object
 4   salary      39 non-null     float64
 5   manager_id  38 non-null     float64
 6   hire_date   40 non-null     object
dtypes: float64(2), int64(1), object(4)
memory usage: 10.9 KB

In [28]:
employees.memory_usage(deep=True).sum()

np.int64(11173)

In [8]:
employees[['first_name','last_name','dept']].nunique()

first_name    40
last_name     40
dept           4
dtype: int64

In [29]:
employees['dept'] = employees['dept'].astype('category')
employees.memory_usage(deep=True)

Index          132
id             320
first_name    2441
last_name     2509
dept           460
salary         320
manager_id     320
hire_date     2680
dtype: int64

In [35]:
employees['hire_date'] = pd.to_datetime(employees['hire_date'])
employees.memory_usage(deep=True)

Index          132
id             160
first_name    2441
last_name     2509
dept           460
salary         160
manager_id     200
hire_date      320
dtype: int64

In [30]:
employees[['first_name', 'last_name']].map(len).describe()

       first_name  last_name
count   40.000000  40.000000
mean     4.025000   5.725000
std      0.831665   1.280775
min      3.000000   3.000000
25%      3.000000   5.000000
50%      4.000000   5.500000
75%      4.250000   6.000000
max      6.000000   9.000000

In [31]:
# 1) Ranges
employees[['id','salary','manager_id']].agg(['min','max'])

# 2) Missingness
employees[['id','salary','manager_id']].isna().sum()

id            0
salary        1
manager_id    2
dtype: int64

In [32]:
employees['id'] = employees['id'].astype('int32')
employees['salary'] = employees['salary'].astype('float32')
employees['manager_id'] = employees['manager_id'].astype('Int32')

In [37]:
employees.memory_usage(deep=True)

Index          132
id             160
first_name    2441
last_name     2509
dept           460
salary         160
manager_id     200
hire_date      320
dtype: int64

In [36]:
employees.memory_usage(deep=True).sum()

np.int64(6382)